In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

Lets import the flight test Data set downloaded

In [2]:
test_Data = pd.read_excel(r"Test_set_flight.xlsx") # only have on sheet else use sheet parameter

In [3]:
pd.set_option('display.max_columns',None) # To show maximum column of the Data

In [5]:
test_Data.head(3)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
0,Jet Airways,6/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,04:25 07 Jun,10h 55m,1 stop,No info
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → MAA → BLR,06:20,10:20,4h,1 stop,No info
2,Jet Airways,21/05/2019,Delhi,Cochin,DEL → BOM → COK,19:15,19:00 22 May,23h 45m,1 stop,In-flight meal not included

In [7]:
test_Data.shape  ## Check the shape of data ie number of features and samples
##As price is not here due to test set columbns are 10

(2671, 10)

In [8]:
test_Data.info()   ## We can see the features and their number of enteris and data types(object and string here)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2671 entries, 0 to 2670
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          2671 non-null   object
 1   Date_of_Journey  2671 non-null   object
 2   Source           2671 non-null   object
 3   Destination      2671 non-null   object
 4   Route            2671 non-null   object
 5   Dep_Time         2671 non-null   object
 6   Arrival_Time     2671 non-null   object
 7   Duration         2671 non-null   object
 8   Total_Stops      2671 non-null   object
 9   Additional_Info  2671 non-null   object
dtypes: object(10)
memory usage: 208.8+ KB

In [9]:
##Now we can explore columns to see what are null values ,missing values,special character any etc..

In [10]:
test_Data.isnull().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              0
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        0
Additional_Info    0
dtype: int64

In [11]:
##AS there is no missing data we wont be needing to eplace null values

Duration Calculation

In [12]:
test_Data["Source"].value_counts() ## Checking the unique values

Delhi       1145
Kolkata      710
Banglore     555
Mumbai       186
Chennai       75
Name: Source, dtype: int64

In [13]:
test_Data["Duration"].value_counts() ## Checking the unique values

2h 50m     122
1h 30m     107
2h 45m      95
2h 55m      81
3h          72
          ...
30h 45m      1
32h 5m       1
32h 20m      1
28h 55m      1
5m           1
Name: Duration, Length: 320, dtype: int64

Starting Test data wrangling(EDA)

Date of Journey

In [14]:
test_Data["Journey_day"] = pd.to_datetime(test_Data.Date_of_Journey,format="%d/%m/%Y").dt.day #Extract Day and 
#adding new column

In [15]:
## We are converting it into time stamp and will extract day,month and year(if different) for calculation of duraton

In [16]:
test_Data["Journey_Month"] = pd.to_datetime(test_Data.Date_of_Journey,format="%d/%m/%Y").dt.month #Extract Month and
#adding new column as journey_month
## Journey Year not needed as data is only for one year

In [17]:
test_Data.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Journey_day,Journey_Month
0,Jet Airways,6/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,04:25 07 Jun,10h 55m,1 stop,No info,6,6
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → MAA → BLR,06:20,10:20,4h,1 stop,No info,12,5

Departure Time

In [18]:
## Same way we will extract hours and minutes from the departure time
##Extract Hours and add column as "Departure_Hour"
test_Data["Departure_Hour"]=pd.to_datetime(test_Data["Dep_Time"]).dt.hour

##Extract Minutes and column as "Departure_Minute"
test_Data["Departure_Minute"]=pd.to_datetime(test_Data["Dep_Time"]).dt.minute

Dropping Unnecessary colums as Dep_Time and Date_of_journey

In [19]:
#test_Data.head(2)   ## Keep checking the additions of columns are ok or not

In [20]:
test_Data.drop(["Date_of_Journey","Dep_Time"] ,axis=1 ,inplace=True) ## Dropping Column wise and placing in same dataset

In [21]:
test_Data.head(2) ## We dont have These two dropped columns here

,Airline,Source,Destination,Route,Arrival_Time,Duration,Total_Stops,Additional_Info,Journey_day,Journey_Month,Departure_Hour,Departure_Minute
0,Jet Airways,Delhi,Cochin,DEL → BOM → COK,04:25 07 Jun,10h 55m,1 stop,No info,6,6,17,30
1,IndiGo,Kolkata,Banglore,CCU → MAA → BLR,10:20,4h,1 stop,No info,12,5,6,20

Arrival Time

In [22]:
## Extract hours and minutes from the Arrival time
##Extract Hours and add column as "Arrival_Hour"
test_Data["Arrival_Hour"]=pd.to_datetime(test_Data["Arrival_Time"]).dt.hour ## Alternate way train_Data.Arrival_Time.

##Extract Minutes and column as "Arrival_Minute"
test_Data["Arrival_Minute"]=pd.to_datetime(test_Data["Arrival_Time"]).dt.minute

In [24]:
## Drop Arrival_Time
test_Data.drop(["Arrival_Time"] ,axis=1 ,inplace=True) ## Dropping Column wise and placing in same dataset

In [26]:
test_Data.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Journey_day,Journey_Month,Departure_Hour,Departure_Minute,Arrival_Hour,Arrival_Minute
0,Jet Airways,Delhi,Cochin,DEL → BOM → COK,10h 55m,1 stop,No info,6,6,17,30,4,25
1,IndiGo,Kolkata,Banglore,CCU → MAA → BLR,4h,1 stop,No info,12,5,6,20,10,20

In [27]:
## Till Now we have converted hours ,days and minute by using the datetime and also dopped 3 columns.

In [28]:
##Nominal Data= data not in any order-- onehoyencoder can be used Ex- Airline here
##Ordinal Data= Data are in order -- LabelEncoder can be use Ex- Hierarchy

Converting Duration in numerical way

In [29]:
##Converting duration column to a list


duration=list(test_Data["Duration"])

for i in range(len(duration)):
    if len(duration[i].split()) !=2:    ## Length of 2h 23m is 2
        if "h" in duration[i]:
            duration[i] =duration[i].strip() + " 0m"  ## spacing before 0m is important else error comes
        else:    
            duration[i]="0h " + duration[i]  ## spacing after 0h is important else error comes
duration_hours=[]
duration_mins=[]            
for i in range(len(duration)):
    duration_hours.append(int(duration[i].split(sep="h")[0]))
    duration_mins.append(int(duration[i].split(sep="m")[0].split()[-1]))  ## till last row

In [30]:
test_Data["Duration_hours"]=duration_hours
test_Data["Duration_mins"]=duration_mins

In [32]:
test_Data.head(2) ## Duration hours and min columns added

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Journey_day,Journey_Month,Departure_Hour,Departure_Minute,Arrival_Hour,Arrival_Minute,Duration_hours,Duration_mins
0,Jet Airways,Delhi,Cochin,DEL → BOM → COK,10h 55m,1 stop,No info,6,6,17,30,4,25,10,55
1,IndiGo,Kolkata,Banglore,CCU → MAA → BLR,4h,1 stop,No info,12,5,6,20,10,20,4,0

In [33]:
##we can drop the duration now
test_Data.drop(["Duration"],axis=1 ,inplace = True)

In [35]:
test_Data.head(2)  ## No duration column

,Airline,Source,Destination,Route,Total_Stops,Additional_Info,Journey_day,Journey_Month,Departure_Hour,Departure_Minute,Arrival_Hour,Arrival_Minute,Duration_hours,Duration_mins
0,Jet Airways,Delhi,Cochin,DEL → BOM → COK,1 stop,No info,6,6,17,30,4,25,10,55
1,IndiGo,Kolkata,Banglore,CCU → MAA → BLR,1 stop,No info,12,5,6,20,10,20,4,0

Airline Column- Categorical data- Nominal Data--One hot encoding

In [36]:
test_Data["Airline"].value_counts()

Jet Airways                          897
IndiGo                               511
Air India                            440
Multiple carriers                    347
SpiceJet                             208
Vistara                              129
Air Asia                              86
GoAir                                 46
Multiple carriers Premium economy      3
Vistara Premium economy                2
Jet Airways Business                   2
Name: Airline, dtype: int64

  One Hot encoding- for Nominal Data- Airline

In [37]:
Airline=test_Data[["Airline"]]
Airline=pd.get_dummies(Airline,drop_first=True) ## Get_Dummies for one hot encoding
Airline.head()                                  ## drop_first is for as we can drop one airline in one hot encoding

,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,Airline_Jet Airways Business,Airline_Multiple carriers,Airline_Multiple carriers Premium economy,Airline_SpiceJet,Airline_Vistara,Airline_Vistara Premium economy
0,0,0,0,1,0,0,0,0,0,0
1,0,0,1,0,0,0,0,0,0,0
2,0,0,0,1,0,0,0,0,0,0
3,0,0,0,0,0,1,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0

  One Hot encoding- for Nominal Data- Source

In [45]:
Source=test_Data[["Source"]]
Source=pd.get_dummies(Source,drop_first=True) ## Get_Dummies for one hot encoding
Source.head()                                  ## drop_first is for as we can drop one City(bangloer here in this case) in one hot encoding

   Source_Chennai  Source_Delhi  Source_Kolkata  Source_Mumbai
0               0             1               0              0
1               0             0               1              0
2               0             1               0              0
3               0             1               0              0
4               0             0               0              0

  One Hot encoding- for Nominal Data- Destination

In [38]:
Destination=test_Data[["Destination"]]
Destination=pd.get_dummies(Destination,drop_first=True) ## Get_Dummies for one hot encoding
Destination.head()

,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,1,0,0,0,0
1,0,0,0,0,0
2,1,0,0,0,0
3,1,0,0,0,0
4,0,1,0,0,0

Total stops column Label encoding-Ordinal data

In [39]:
 test_Data["Total_Stops"].value_counts()

1 stop      1431
non-stop     849
2 stops      379
3 stops       11
4 stops        1
Name: Total_Stops, dtype: int64

In [40]:
##as this is an ordinal categorical data so we can convert them as Label Encoder
##Label Encoding for Total stops as from box plot we have seen from box ploty of price and total stops that
##moere the stops more the price so we can rank them and give them Label encoding instead of one hot encoding

In [41]:
test_Data.replace({"non-stop": 0 , "1 stop" : 1 ,"2 stops": 2 , "3 stops" : 3, "4 stops" : 4},inplace=True)
## Label Encoding given as a dictionary

In [42]:
#Route and Number of stops are giving same information so we can drop it
#Also the additional info volumn also not giving any information we can drop that also.

test_Data.drop(["Route","Additional_Info"] ,axis=1 ,inplace=True)

In [43]:
test_Data.head(2)  ## We have dropped Route and Additional info and converted Total stop as Label Encoding

,Airline,Source,Destination,Total_Stops,Journey_day,Journey_Month,Departure_Hour,Departure_Minute,Arrival_Hour,Arrival_Minute,Duration_hours,Duration_mins
0,Jet Airways,Delhi,Cochin,1,6,6,17,30,4,25,10,55
1,IndiGo,Kolkata,Banglore,1,12,5,6,20,10,20,4,0

Concatantion of one hot encoded Data
train_Data with Airline , Source and Destination as they Get encode seperately

In [46]:
data_Test=pd.concat([test_Data,Airline,Source,Destination],axis=1)

In [47]:
data_Test.head(2)  ## Data with Encoded columns

,Airline,Source,Destination,Total_Stops,Journey_day,Journey_Month,Departure_Hour,Departure_Minute,Arrival_Hour,Arrival_Minute,Duration_hours,Duration_mins,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,Airline_Jet Airways Business,Airline_Multiple carriers,Airline_Multiple carriers Premium economy,Airline_SpiceJet,Airline_Vistara,Airline_Vistara Premium economy,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,Jet Airways,Delhi,Cochin,1,6,6,17,30,4,25,10,55,0,0,0,1,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0
1,IndiGo,Kolkata,Banglore,1,12,5,6,20,10,20,4,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0

In [48]:
data_Test.shape  ## Encoded data is having more columns here

(2671, 31)

In [49]:
##We can Drop Airline names Sources and Destination column as we have converted them into one hot encoding
data_Test.drop(["Airline","Source","Destination"],axis=1 ,inplace=True)

In [50]:
data_Test.shape

(2671, 28)

In [52]:
data_Test.head(2)  ## shape will be now having 29 columns as 3 dropped but it is having 28 bcause airline trujet is not in data

,Total_Stops,Journey_day,Journey_Month,Departure_Hour,Departure_Minute,Arrival_Hour,Arrival_Minute,Duration_hours,Duration_mins,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,Airline_Jet Airways Business,Airline_Multiple carriers,Airline_Multiple carriers Premium economy,Airline_SpiceJet,Airline_Vistara,Airline_Vistara Premium economy,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,1,6,6,17,30,4,25,10,55,0,0,0,1,0,0,0,0,0,0,0,1,0,0,1,0,0,0,0
1,1,12,5,6,20,10,20,4,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0

In [53]:
data_Test.to_csv('test_Data.csv')